<a href="https://colab.research.google.com/github/isaiastrajano/BootCamp_Python_DataScience/blob/main/Exercicio_estatisticadescritiva.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Exercícios de estatística descritiva

In [13]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

Exercício 1

Os dados abaixo referem-se a quantidade produzida de lavouras permanentes no Brasil, entre 2017 e 2019. Construa o DataFrame abaixo e seguidamente faça:

a) obtenha a quantidade total produzida pelas lavouras em cada ano;

b) obtenha a quantidade total produzida por cada lavoura ao longo do tempo;

c) mostre um resumo das estatísticas descritivas;

d) converta o banco de dados para csv.

In [14]:
dados = { 'Abacate':{ 2017: 212873, 2018: 236177, 2019: 242932 }, 'Açaí':{ 2017:1335040, 2018:1301472, 2019:1398328 }, 'Banana':{ 2017:6584967, 2018:6723590, 2019:6812708 }, 'Cacau':{ 2017:235809, 2018:239318, 2019:259425 }, 'Laranja':{ 2017:17492882, 2018:16841549, 2019:17073593 }, 'Maçã':{ 2017:1307642, 2018:1203007, 2019:1222970 }, 'Mamão':{ 2017:1058487, 2018:1065421, 2019:1161808 }, 'Manga':{ 2017:1089882, 2018:1320458, 2019:1414338 }, }

In [15]:
dados

{'Abacate': {2017: 212873, 2018: 236177, 2019: 242932},
 'Açaí': {2017: 1335040, 2018: 1301472, 2019: 1398328},
 'Banana': {2017: 6584967, 2018: 6723590, 2019: 6812708},
 'Cacau': {2017: 235809, 2018: 239318, 2019: 259425},
 'Laranja': {2017: 17492882, 2018: 16841549, 2019: 17073593},
 'Mamão': {2017: 1058487, 2018: 1065421, 2019: 1161808},
 'Manga': {2017: 1089882, 2018: 1320458, 2019: 1414338},
 'Maçã': {2017: 1307642, 2018: 1203007, 2019: 1222970}}

In [16]:
data = pd.DataFrame(dados)

In [17]:
#a
data['total'] = data.sum(axis=1)
#somando os valores do eixo x
data

      Abacate     Açaí   Banana   Cacau  ...     Maçã    Mamão    Manga     total
2017   212873  1335040  6584967  235809  ...  1307642  1058487  1089882  29317582
2018   236177  1301472  6723590  239318  ...  1203007  1065421  1320458  28930992
2019   242932  1398328  6812708  259425  ...  1222970  1161808  1414338  29586102

[3 rows x 9 columns]

In [18]:
#b
datat = data.T
datat['total'] = datat.sum(axis=1)
datat

             2017      2018      2019     total
Abacate    212873    236177    242932    691982
Açaí      1335040   1301472   1398328   4034840
Banana    6584967   6723590   6812708  20121265
Cacau      235809    239318    259425    734552
Laranja  17492882  16841549  17073593  51408024
Maçã      1307642   1203007   1222970   3733619
Mamão     1058487   1065421   1161808   3285716
Manga     1089882   1320458   1414338   3824678
total    29317582  28930992  29586102  87834676

In [19]:
#c
data.describe()

             Abacate          Açaí  ...         Manga         total
count       3.000000  3.000000e+00  ...  3.000000e+00  3.000000e+00
mean   230660.666667  1.344947e+06  ...  1.274893e+06  2.927823e+07
std     15770.488906  4.918209e+04  ...  1.669583e+05  3.293235e+05
min    212873.000000  1.301472e+06  ...  1.089882e+06  2.893099e+07
25%    224525.000000  1.318256e+06  ...  1.205170e+06  2.912429e+07
50%    236177.000000  1.335040e+06  ...  1.320458e+06  2.931758e+07
75%    239554.500000  1.366684e+06  ...  1.367398e+06  2.945184e+07
max    242932.000000  1.398328e+06  ...  1.414338e+06  2.958610e+07

[8 rows x 9 columns]

In [20]:
#d
data.to_csv('dados_prod.csv', index = False)

Exercício 2

Com base no dataset anterior obtenha:

a) média da quantidade total produzida das respectivas lavouras em 2017, 2018 e 2019;

b) média da quantidade produzida de cada lavoura entre o período selecionado;

c) desvio padrão da quantidade total produzida das respectivas lavouras em 2017, 2018 e 2019;

d) desvio padrão da quantidade produzida de cada lavoura entre o período selecionado;

e) variância da quantidade total produzida das respectivas lavouras em 2017, 2018 e 2019;

In [21]:
#a
datat.drop(labels = ['total'], axis = 1, inplace = True)
datat['Média'] = datat.median(axis=1)
datat

             2017      2018      2019       Média
Abacate    212873    236177    242932    236177.0
Açaí      1335040   1301472   1398328   1335040.0
Banana    6584967   6723590   6812708   6723590.0
Cacau      235809    239318    259425    239318.0
Laranja  17492882  16841549  17073593  17073593.0
Maçã      1307642   1203007   1222970   1222970.0
Mamão     1058487   1065421   1161808   1065421.0
Manga     1089882   1320458   1414338   1320458.0
total    29317582  28930992  29586102  29317582.0

In [24]:
#c
#datat.drop(labels = ['Média'], axis = 1, inplace = True)
#datat.drop(labels = ['total'], axis = 1, inplace = True)
datat['Média Std'] = datat.std(axis=1)
datat

             2017      2018      2019      Média Std
Abacate    212873    236177    242932   15770.488906
Açaí      1335040   1301472   1398328   49182.087363
Banana    6584967   6723590   6812708  114763.755264
Cacau      235809    239318    259425   12743.102618
Laranja  17492882  16841549  17073593  330121.785696
Maçã      1307642   1203007   1222970   55552.305950
Mamão     1058487   1065421   1161808   57754.888921
Manga     1089882   1320458   1414338  166958.299241
total    29317582  28930992  29586102  329323.531551

In [28]:
#e
#datat.drop(labels = ['Média Std'], axis = 1, inplace = True)
datat['Variancia'] = np.var(datat, axis = 1)
datat

             2017      2018      2019     Variancia
Abacate    212873    236177    242932  1.658055e+08
Açaí      1335040   1301472   1398328  1.612585e+09
Banana    6584967   6723590   6812708  8.780480e+09
Cacau      235809    239318    259425  1.082578e+08
Laranja  17492882  16841549  17073593  7.265360e+10
Maçã      1307642   1203007   1222970  2.057372e+09
Mamão     1058487   1065421   1161808  2.223751e+09
Manga     1089882   1320458   1414338  1.858338e+10
total    29317582  28930992  29586102  7.230266e+10

Exercício 3

Calcule e imprima na tela:

a) média das vendas diárias;

b) desvio padrão;

c) variância;

d) moda;

e) quantidade total vendida no período;

f) valor máximo de vendas e o dia respectivo;

g) valor mínimo de vendas e o dia rescpetivo.

In [58]:
#criando o dataset
datalista = pd.date_range(start ='12-1-2020', end ='12-10-2020')
vendas = [10, 38, 47, 9, 11, 9, 21, 49, 17, 29]
dataset = pd.DataFrame(index = datalista, data = vendas)
dataset.rename({0: 'Venda Diaria'}, axis = 1, inplace = True)
dataset

            Venda Diaria
2020-12-01            10
2020-12-02            38
2020-12-03            47
2020-12-04             9
2020-12-05            11
2020-12-06             9
2020-12-07            21
2020-12-08            49
2020-12-09            17
2020-12-10            29

In [59]:
#a, b
dataset.describe()

       Venda Diaria
count     10.000000
mean      24.000000
std       15.804359
min        9.000000
25%       10.250000
50%       19.000000
75%       35.750000
max       49.000000

In [60]:
dataset.var()

Venda Diaria    249.777778
dtype: float64

In [62]:
dataset.mode()

   Venda Diaria
0             9

In [70]:
dataset.max()

Venda Diaria    49
dtype: int64

In [77]:
dataset.min()

Venda Diaria    9
dtype: int64

In [79]:
dataset.loc[dataset['Venda Diaria'].idxmax()]
#ou
#dataset[dataset['Venda Diaria']==dataset['Venda Diaria'].max()]

Venda Diaria    49
Name: 2020-12-08 00:00:00, dtype: int64

In [93]:
dataset.loc[dataset['Venda Diaria'].idxmin()]
#ou
#dataset[dataset['Venda Diaria']==dataset['Venda Diaria'].min()]

Venda Diaria    9
Name: 2020-12-04 00:00:00, dtype: int64

Exercício 4

O objetivo deste exercício é identificar o perfil de cada consumidor de esteira da empresa CardioGoodFitness.


Significado das colunas:

    Product: produtos adquiridos;

    Age: idade dos clientes, em anos;

    Gender: gênero;

    Education: educação em anos;

    MaritalStatus: status civil;

    Usage: número médio de vezes que o cliente planeja usar a esteira por semana;

    Fitness: índice de autoavaliação fitness, em uma escala de 1 a 5, sendo 1 denotando má forma e 5 excelente forma;

    Income: renda familiar anual;

    Miles: número médio de milhas que cada cliente espera andar/correr por semana.

Baixe o dataset anexo nesta aula.

Com base nestas informações:

    Leia o dataset e armazene em uma variável;

    Mostre as 3 primeiras linhas do dataset;

    Mostre as duas últimas linhas do dataset;

    Mostre o shape do dataset;

    Obtenha informações das colunas com o método info();

    Mostre estatísticas descritivas das colunas numéricas;

    Mostre o tipo de dado de cada coluna;

    Converta o dtype da coluna Income para float.